upgrate_data_wage/high_dim/vel3.888888888888889/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       9440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       9480;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       9520;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       9560;
    }
    obstacle
    {
        type            patch;
        nFaces          80;
        startFace       9680;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       9760;
    }
)

// ************************************************************************* //
